TessEpsCntrl.m_TessEpsCntrlVersion
Version number, needed for backward-compatibility. Version 0 uses old tolerances.

TessEpsCntrl.getTessTol
getTessTol returns the tessellation tolerance for curves and edges. This provides an upper
bound for the chord-height deviation of the tessellation from the curve or edge. Other
conditions may also be imposed on the tessellation (e.g., an angle tolerance).
DO NOT CONFUSE THIS WITH THE VERTEX TOLERANCE OR THE SHORT CURVE TOLERANCE !!!!!

TessEpsCntrl.setVersion(TessEpsCntrlVersion!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Use of this function is restricted to friends of the TessEpsCntrlVersion class. Do not use
this function unless you've discussed it with John. It exists solely for backward compatibility.

TessEpsCntrl.getTessAngleTol
Default upper bound for angle between consecutive segments of a curve or edge tessellation,
if an angle constraint is specified. Value is in radians.

TessEpsCntrl.getShortCurveTol
getShortCurveTol returns the "short curve tolerance". We should not create (or allow the
user to create) curves or edges shorter than this value.
DO NOT CONFUSE THIS WITH THE VERTEX TOLERANCE (see getVertexEps)!!!!!

TessEpsCntrl.getVertexEps
getVertexEps returns the vertex tolerance. Two points within this distance are considered
coincident.
DO NOT CONFUSE THIS WITH THE SHORT CURVE TOLERANCE (see getShortCurveTol)!!!!!

TessEpsCntrl.#ctor(TessEpsCntrlType,TessEpsCntrlVersion!System.Runtime.CompilerServices.IsConst*)
Input "type" specifies the type of space this TessEpsCntrl refers to.
TESS_EPS_MODEL specifies "model space" (for ordinary geometry of buildings).
TESS_EPS_ANNOTATION specifies "paper space" (for annotation objects).
Optional input "pVersion" is not intended for general use. DO NOT SET THE pVersion
ARGUMENT UNLESS YOU'VE DISCUSSED IT WITH JOHN.